source/org_posts/2013-06-11-emberjs-rails4-tutorial.org
#+BEGIN_HTML
---
layout: post
title: "Ember.js Tutorial with Rails 4"
date: 2013-06-11 13:00
redirect_from: /blog/2013/06/11/creating-ember-dot-js-guides-tutorial-with-rails-4/index.html
comments: true
categories: [rails, emberjs]
keywords: Rails4, Rails, Ruby on Rails, Ember.js, Emberjs, Persistence, Serialization, Controllers, Router, Tutorial
description: This post demonstrates how to build a simple Ember.js app with Rails 4 for persistence, and includes a detailed screencast. 
published: true
canonical: https://www.shakacode.com/blog/emberjs-rails4-tutorial/
---
#+END_HTML

The first post in this series, [[http://www.railsonmaui.com/blog/2013/05/26/ember-dot-js-hello-world/][Ember.js Hello World]], shows Ember working
without a persistence backend. This post covers setting up Rails4 as the
persistence engine behind that example, plus adding and deleting records. The
amount of Ember and Rails code to make this example is almost completely
included in this article. It's that tiny!

The source code for the completed example can be found on GitHub:
[[https://github.com/justin808/ember-js-guides-railsonmaui-rails4][justin808/ember-js-guides-railsonmaui-rails4]]. I carefully crafted the commits
to explain the steps.

You can try out the application on Heroku at:
http://railsonmaui-emberjs-rails4.herokuapp.com/

I put many more details in this [[http://youtu.be/ac1mYhCMRNc][comprehensive screencast]] of how to go from a
brand new Rails 4 app to an Ember.js app deployed on Heroku.

{% youtube ac1mYhCMRNc %}

* Key Tips
1. Be sure to update the =ember= and =ember-data= javascript files with the
   command from the ember-rails gem (see below). Keeping these files at
   appropriate versions is key while the API is changing, especially for
   ember-data.
2. If you specify the Router property for both =model= and =setupController=,
   you can have some very confusing results (details below).
3. Get comfortable with Ember's naming conventions. Ember does a ton with
   default naming. It's basically got the same philosophy of "Convention over
   Configuration" of Rails. So it's especially important to try to grok when the
   Ember examples are doing something implicitly versus explicitly. This is a
   bit like Rails. At first it seems like magic, like "How the heck is that
   happening", and then one gets accustomed to the naming conventions and
   appreciates how much code it saves.
4. Be mindful that some Ember.js commands run asynchronously, such as commit.

#+begin_html
<!-- more -->
#+end_html

* Building the Hello World without Persistence
The steps for this can be found in the git history up to tag =no-persistence=.
Thanks to a few gems, the process is relatively simple.
** Basic Setup
I started off with the instructions here [[http://blog.dcxn.com/2013/03/23/getting-started-with-ember-js-on-rails/][The No Nonsense Guide to Ember.js on
Rails]]. This article covers the basic setup, such as gems to include. You want to
pay special attention to the [[https://github.com/emberjs/ember-rails][README for ember-rails]]. Depending on the current
state of the ember-rails gem, you may get the deprecation warning (browser
console) with the old ember-data.js.

  #+BEGIN_EXAMPLE
  DEPRECATION: register("store", "main") is now deprecated in-favour of register("store:main");
          at Object.Container.register (http://0.0.0.0:3000/assets/ember.js?body=1:7296:17)
          at Application.initializer.initialize (http://0.0.0.0:3000/assets/ember-data.js?body=1:5069:19)
          at http://0.0.0.0:3000/assets/ember.js?body=1:27903:7
          at visit (http://0.0.0.0:3000/assets/ember.js?body=1:27041:3)
          at DAG.topsort (http://0.0.0.0:3000/assets/ember.js?body=1:27095:7)
          at Ember.Application.Ember.Namespace.extend.runInitializers (http://0.0.0.0:3000/assets/ember.js?body=1:27900:11)
          at Ember.Application.Ember.Namespace.extend._initialize (http://0.0.0.0:3000/assets/ember.js?body=1:27784:10)
          at Object.Backburner.run (http://0.0.0.0:3000/assets/ember.js?body=1:4612:26)
          at Object.Ember.run (http://0.0.0.0:3000/assets/ember.js?body=1:5074:26) 
  #+END_EXAMPLE

Originally, I included a separate version of ember-data in the git repository.
Instead, I should have updated the versions of ember and ember-data with this
command from the [[https://github.com/emberjs/ember-rails][ember-rails README]]:
#+BEGIN_SRC bash
  rails generate ember:install --head
#+END_SRC
This command puts the ember files in =vendor/assets/ember=. Pretty sweet. This
is way better than manually installing the js files.

** Get the no-database fixture example of Ember.js working.
Next, I migrated the non-rails static example presented in [[http://www.railsonmaui.com/blog/2013/05/26/ember-dot-js-hello-world/][Ember.js Hello World]]
to the rails framework. You can checkout the tag =no-persistence= and get the
code to where the static fixture is used and there is no persistence. Scroll to
the bottom to see this code, as well as some additional code added for persistence.

* Building the Hello World with Persistence
** Create the Model for Blog Posts
You can checkout the git tag =persistence-emberjs= to get the git repository to
the state that persistence works.
#+BEGIN_SRC bash
$ rails generate model Post title:string author:string published_at:date intro:text extended:text
$ rake db:migrate
#+END_SRC

Since Rails comes pre-configured with sqllite3 by default, no database
configuration is required.
** Add the Controller and Serializer
Note that in Rails 4, you need to use the form for "strong parameters". See the
definition of =post_params= below.
*** app/models/post.rb
#+BEGIN_SRC ruby
class Post < ActiveRecord::Base
  validates_presence_of :published_at, :author
end
#+END_SRC

*** app/serializers/post_serializer.rb
#+BEGIN_SRC ruby
class PostSerializer < ActiveModel::Serializer
  attributes :id, :title, :author, :published_at, :intro, :extended
end
#+END_SRC

*** app/controllers/posts_controller.rb
#+BEGIN_SRC ruby
class PostsController < ApplicationController
  respond_to :json # default to Active Model Serializers
  def index
    respond_with Post.all
  end

  def show
    respond_with Post.find(params[:id])
  end

  def create
    respond_with Post.create(post_params)
  end

  def update
    respond_with Post.update(params[:id], post_params)
  end

  def destroy
    respond_with Post.destroy(params[:id])
  end

  private
  def post_params
    params.require(:post).permit(:title, :intro, :extended, :published_at, :author) # only allow these for now
  end
end
#+END_SRC

