source/_posts/2013-06-11-emberjs-rails4-tutorial.html
---
layout: post
title: "Ember.js Tutorial with Rails 4"
date: 2013-06-11 13:00
alias: blog/2013/06/11/creating-ember-dot-js-guides-tutorial-with-rails-4/index.html
comments: true
categories: [rails, emberjs]
keywords: Rails4, Rails, Ruby on Rails, Ember.js, Emberjs, Persistence, Serialization, Controllers, Router, Tutorial
description: This post demonstrates how to build a simple Ember.js app with Rails 4 for persistence, and includes a detailed screencast. 
published: true
---

<p>
The first post in this series, <a href="http://www.railsonmaui.com/blog/2013/05/26/ember-dot-js-hello-world/">Ember.js Hello World</a>, shows Ember working
without a persistence backend. This post covers setting up Rails4 as the
persistence engine behind that example, plus adding and deleting records. The
amount of Ember and Rails code to make this example is almost completely
included in this article. It's that tiny!
</p>

<p>
The source code for the completed example can be found on GitHub:
<a href="https://github.com/justin808/ember-js-guides-railsonmaui-rails4">justin808/ember-js-guides-railsonmaui-rails4</a>. I carefully crafted the commits
to explain the steps.
</p>

<p>
You can try out the application on Heroku at:
<a href="http://railsonmaui-emberjs-rails4.herokuapp.com/">http://railsonmaui-emberjs-rails4.herokuapp.com/</a>
</p>

<p>
I put many more details in this <a href="http://youtu.be/ac1mYhCMRNc">comprehensive screencast</a> of how to go from a
brand new Rails 4 app to an Ember.js app deployed on Heroku.
</p>

<p>
{% youtube ac1mYhCMRNc %}
</p>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1">Key Tips</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li>Be sure to update the <code>ember</code> and <code>ember-data</code> javascript files with the
command from the ember-rails gem (see below). Keeping these files at
appropriate versions is key while the API is changing, especially for
ember-data.
</li>
<li>If you specify the Router property for both <code>model</code> and <code>setupController</code>,
you can have some very confusing results (details below).
</li>
<li>Get comfortable with Ember's naming conventions. Ember does a ton with
default naming. It's basically got the same philosophy of "Convention over
Configuration" of Rails. So it's especially important to try to grok when the
Ember examples are doing something implicitly versus explicitly. This is a
bit like Rails. At first it seems like magic, like "How the heck is that
happening", and then one gets accustomed to the naming conventions and
appreciates how much code it saves.
</li>
<li>Be mindful that some Ember.js commands run asynchronously, such as commit.
</li>
</ol>

<!-- more -->
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2">Building the Hello World without Persistence</h2>
<div class="outline-text-2" id="text-2">
<p>
The steps for this can be found in the git history up to tag <code>no-persistence</code>.
Thanks to a few gems, the process is relatively simple.
</p>
</div>
<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1">Basic Setup</h3>
<div class="outline-text-3" id="text-2-1">
<p>
I started off with the instructions here <a href="http://blog.dcxn.com/2013/03/23/getting-started-with-ember-js-on-rails/">The No Nonsense Guide to Ember.js on
Rails</a>. This article covers the basic setup, such as gems to include. You want to
pay special attention to the <a href="https://github.com/emberjs/ember-rails">README for ember-rails</a>. Depending on the current
state of the ember-rails gem, you may get the deprecation warning (browser
console) with the old ember-data.js.
</p>

<pre class="example">
DEPRECATION: register("store", "main") is now deprecated in-favour of register("store:main");
        at Object.Container.register (http://0.0.0.0:3000/assets/ember.js?body=1:7296:17)
        at Application.initializer.initialize (http://0.0.0.0:3000/assets/ember-data.js?body=1:5069:19)
        at http://0.0.0.0:3000/assets/ember.js?body=1:27903:7
        at visit (http://0.0.0.0:3000/assets/ember.js?body=1:27041:3)
        at DAG.topsort (http://0.0.0.0:3000/assets/ember.js?body=1:27095:7)
        at Ember.Application.Ember.Namespace.extend.runInitializers (http://0.0.0.0:3000/assets/ember.js?body=1:27900:11)
        at Ember.Application.Ember.Namespace.extend._initialize (http://0.0.0.0:3000/assets/ember.js?body=1:27784:10)
        at Object.Backburner.run (http://0.0.0.0:3000/assets/ember.js?body=1:4612:26)
        at Object.Ember.run (http://0.0.0.0:3000/assets/ember.js?body=1:5074:26)
</pre>

<p>
Originally, I included a separate version of ember-data in the git repository.
Instead, I should have updated the versions of ember and ember-data with this
command from the <a href="https://github.com/emberjs/ember-rails">ember-rails README</a>:
</p>
{% codeblock lang:bash %}
rails generate ember:install --head
{% endcodeblock %}
<p>
This command puts the ember files in <code>vendor/assets/ember</code>. Pretty sweet. This
is way better than manually installing the js files.
</p>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2">Get the no-database fixture example of Ember.js working.</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Next, I migrated the non-rails static example presented in <a href="http://www.railsonmaui.com/blog/2013/05/26/ember-dot-js-hello-world/">Ember.js Hello World</a>
to the rails framework. You can checkout the tag <code>no-persistence</code> and get the
code to where the static fixture is used and there is no persistence. Scroll to
the bottom to see this code, as well as some additional code added for persistence.
</p>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3">Building the Hello World with Persistence</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1">Create the Model for Blog Posts</h3>
<div class="outline-text-3" id="text-3-1">
<p>
You can checkout the git tag <code>persistence-emberjs</code> to get the git repository to
the state that persistence works.
</p>
{% codeblock lang:bash %}
$ rails generate model Post title:string author:string published_at:date intro:text extended:text
$ rake db:migrate
{% endcodeblock %}

<p>
Since Rails comes pre-configured with sqllite3 by default, no database
configuration is required.
</p>
</div>
</div>

<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2">Add the Controller and Serializer</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Note that in Rails 4, you need to use the form for "strong parameters". See the
definition of <code>post_params</code> below.
</p>
</div>
<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1">app/models/post.rb</h4>
<div class="outline-text-4" id="text-3-2-1">
{% codeblock lang:ruby %}
class Post < ActiveRecord::Base
  validates_presence_of :published_at, :author
end
{% endcodeblock %}
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2">app/serializers/post_serializer.rb</h4>
<div class="outline-text-4" id="text-3-2-2">
{% codeblock lang:ruby %}
class PostSerializer < ActiveModel::Serializer
  attributes :id, :title, :author, :published_at, :intro, :extended
end
{% endcodeblock %}
</div>
</div>
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3">app/controllers/posts_controller.rb</h4>
<div class="outline-text-4" id="text-3-2-3">
{% codeblock lang:ruby %}
class PostsController < ApplicationController
  respond_to :json # default to Active Model Serializers
  def index
    respond_with Post.all
  end

  def show
    respond_with Post.find(params[:id])
  end

  def create
    respond_with Post.create(post_params)
  end

  def update
    respond_with Post.update(params[:id], post_params)
  end

  def destroy
    respond_with Post.destroy(params[:id])
  end

  private
  def post_params
    params.require(:post).permit(:title, :intro, :extended, :published_at, :author) # only allow these for now
  end
end
{% endcodeblock %}
</div>
</div>
</div>
