source/org_posts/2013-06-11-emberjs-rails4-tutorial.org
** Adding "Add" and "Remove" Buttons
+ To create a new post, *use a link, not a button*, because we want to change the URL.
+ Don't define both =model= and =setupController= on the Route!
  If you do, you'll get this error:
  #+BEGIN_EXAMPLE
  Uncaught Error: assertion failed: Cannot delegate set('title', a) to the 'content' property of object proxy <App.PostsNewController:ember392>: its 'content' is undefined.  
  #+END_EXAMPLE
  I originally had code like this and it took me some time to figure out that
  the =model= part was not used. 
  #+BEGIN_SRC coffeescript
  App.PostsNewRoute = Ember.Route.extend(
    model: ->
      App.Post.createRecord(publishedAt: new Date(), author: "current user")
    setupController: (controller) ->
      # controller.set('content', App.Post.createRecord(publishedAt: new Date(), author: "current user"))
  )   
  #+END_SRC

** Update the URL on New with transitionAfterSave Hook
You can't update the URL after a new record is saved directly in the event
handler, as the commit will run asynchronously, and until the return value,
there is no record id, and you would end up using record id =null= in the URL.
Here's how to handle this situation. Not that the =save= does the commit, but
the =transitionToRoute= is not called until the =transitionAfterSave= hook is
run.
#+BEGIN_SRC ruby
App.PostsNewController = Ember.ObjectController.extend(
  save: ->
    @get('store').commit()

  transitionAfterSave: ( ->
    # when creating new records, it's necessary to wait for the record to be assigned
    # an id before we can transition to its route (which depends on its id)
    @transitionToRoute('post', @get('content')) if @get('content.id')
  ).observes('content.id')
)
#+END_SRC

** Don't put the new record, unsaved post in the list of saved posts
There's a slight bug in the adding of new records. If you click on the unsaved
post link on the left, the URL will have "null" as the new post does not yet
have an ID.

Here's the [[https://github.com/justin808/ember-js-guides-railsonmaui-rails4/commit/8c58b6fac8b978f622bf772654258479ba22bae0][commit at github]], and the commit description:
#+begin_quote
See discussion at
http://stackoverflow.com/questions/14705124/creating-a-record-with-ember-js-ember-data-rails-and-handling-list-of-record
Note the change from iterating over "each model" to iterating over "each post in
filteredContent" in index.html.erb. That change requires attributes be
referenced by "post", and the updated linkTo takes the route, "post", as well as
the "dynamic segment" which is also named "post", per the above #each post.
(refer to http://emberjs.com/guides/templates/links/). Note the addition of the
PostsController. Previously, it was implicitly defined. It listens to property
"arrangedContent.@each" so that when the new post saves, the filteredContent
property updates and notifies the view template using this property in
index.html.erb. Without the listener on this property, the view of all posts
would not update.
#+end_quote

This is a really important change that is well documented in the commit as well
as the [[http://youtu.be/ac1mYhCMRNc?t%3D36m20s][tutorial screencast at 36:20]].


* Heroku Deployment
Heroku has listed many tips at [[https://devcenter.heroku.com/articles/rails4][Getting Started with Rails 4.x on Heroku]]. And you
can look at the commits leading up to tag =heroku=. The basic steps are:
1. Change a few gems
2. Switch from sqllite to postgres.
3. Add a ProcFile to use Puma for the webserver.
4. Be sure that production.rb contains:
   #+BEGIN_SRC ruby
   config.ember.variant = :production
   #+END_SRC
   If you don't, you'll see this error:
   #+BEGIN_EXAMPLE
   RAILS_ENV=production bin/rake assets:precompile
   rake aborted!
   couldn't find file 'handlebars'
     (in /Users/justin/j/emberjs/ember-js-guides-railsonmaui-rails4/app/app/assets/javascripts/application.js:18)
   #+END_EXAMPLE
* Examples that Inspired this Tutorial
** RailsCasts
+ The two RailsCasts episodes complement the [[http://www.youtube.com/watch?v%3DGa99hMi7wfY][first tutorial by Tom Dale]] by
  showing how to add persistence via the =rails-ember= gem. The serializers
  episode is also useful.
  + [[http://railscasts.com/episodes/408-ember-part-1][#408 Ember Part 1]] (pro)
  + [[http://railscasts.com/episodes/410-ember-part-2][#410 Ember Part 2]] (pro)
  + [[http://railscasts.com/episodes/409-active-model-serializers?view%3Dcomments][#409 Active Model Serializers]]
+ Tip: Using Chrome to watch the videos: I found that the left/right arrow and
  space bar keys are amazing for pausing and rewinding the RailsCasts so that I
  could get all the nuances of the Ember naming schemes.
** ember_data_example
+ [[https://github.com/dgeb/ember_data_example][ember_data_example]] on GitHub is a nice full featured ember app with a parent
  child relationship of contacts and phone numbers. It even has some examples
  of using [[https://github.com/jfirebaugh/konacha][Konacha for testing Ember JavaScript code]].

* Source Code for Views and JavaScript
I purposefully kept these to just 2 files to make this example simple. In a
real world application, this would be broken into many files.
