source/_posts/2013-06-11-emberjs-rails4-tutorial.html
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3">Adding "Add" and "Remove" Buttons</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>To create a new post, <b>use a link, not a button</b>, because we want to change the URL.
</li>
<li>Don't define both <code>model</code> and <code>setupController</code> on the Route!
If you do, you'll get this error:
<pre class="example">
Uncaught Error: assertion failed: Cannot delegate set('title', a) to the 'content' property of object proxy &lt;App.PostsNewController:ember392&gt;: its 'content' is undefined.
</pre>
<p>
I originally had code like this and it took me some time to figure out that
the <code>model</code> part was not used. 
</p>
{% codeblock lang:coffeescript %}
App.PostsNewRoute = Ember.Route.extend(
  model: ->
    App.Post.createRecord(publishedAt: new Date(), author: "current user")
  setupController: (controller) ->
    # controller.set('content', App.Post.createRecord(publishedAt: new Date(), author: "current user"))
)   
{% endcodeblock %}
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4">Update the URL on New with transitionAfterSave Hook</h3>
<div class="outline-text-3" id="text-3-4">
<p>
You can't update the URL after a new record is saved directly in the event
handler, as the commit will run asynchronously, and until the return value,
there is no record id, and you would end up using record id <code>null</code> in the URL.
Here's how to handle this situation. Not that the <code>save</code> does the commit, but
the <code>transitionToRoute</code> is not called until the <code>transitionAfterSave</code> hook is
run.
</p>
{% codeblock lang:ruby %}
App.PostsNewController = Ember.ObjectController.extend(
  save: ->
    @get('store').commit()

  transitionAfterSave: ( ->
    # when creating new records, it's necessary to wait for the record to be assigned
    # an id before we can transition to its route (which depends on its id)
    @transitionToRoute('post', @get('content')) if @get('content.id')
  ).observes('content.id')
)
{% endcodeblock %}
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5">Don't put the new record, unsaved post in the list of saved posts</h3>
<div class="outline-text-3" id="text-3-5">
<p>
There's a slight bug in the adding of new records. If you click on the unsaved
post link on the left, the URL will have "null" as the new post does not yet
have an ID.
</p>

<p>
Here's the <a href="https://github.com/justin808/ember-js-guides-railsonmaui-rails4/commit/8c58b6fac8b978f622bf772654258479ba22bae0">commit at github</a>, and the commit description:
</p>
<blockquote>
<p>
See discussion at
<a href="http://stackoverflow.com/questions/14705124/creating-a-record-with-ember-js-ember-data-rails-and-handling-list-of-record">http://stackoverflow.com/questions/14705124/creating-a-record-with-ember-js-ember-data-rails-and-handling-list-of-record</a>
Note the change from iterating over "each model" to iterating over "each post in
filteredContent" in index.html.erb. That change requires attributes be
referenced by "post", and the updated linkTo takes the route, "post", as well as
the "dynamic segment" which is also named "post", per the above #each post.
(refer to <a href="http://emberjs.com/guides/templates/links/">http://emberjs.com/guides/templates/links/</a>). Note the addition of the
PostsController. Previously, it was implicitly defined. It listens to property
"arrangedContent.@each" so that when the new post saves, the filteredContent
property updates and notifies the view template using this property in
index.html.erb. Without the listener on this property, the view of all posts
would not update.
</p>
</blockquote>

<p>
This is a really important change that is well documented in the commit as well
as the <a href="http://youtu.be/ac1mYhCMRNc?t=36m20s">tutorial screencast at 36:20</a>.
</p>
</div>
</div>
</div>

<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4">Heroku Deployment</h2>
<div class="outline-text-2" id="text-4">
<p>
Heroku has listed many tips at <a href="https://devcenter.heroku.com/articles/rails4">Getting Started with Rails 4.x on Heroku</a>. And you
can look at the commits leading up to tag <code>heroku</code>. The basic steps are:
</p>
<ol class="org-ol">
<li>Change a few gems
</li>
<li>Switch from sqllite to postgres.
</li>
<li>Add a ProcFile to use Puma for the webserver.
</li>
<li>Be sure that production.rb contains:
{% codeblock lang:ruby %}
config.ember.variant = :production
{% endcodeblock %}
<p>
If you don't, you'll see this error:
</p>
<pre class="example">
RAILS_ENV=production bin/rake assets:precompile
rake aborted!
couldn't find file 'handlebars'
  (in /Users/justin/j/emberjs/ember-js-guides-railsonmaui-rails4/app/app/assets/javascripts/application.js:18)
</pre>
</li>
</ol>
</div>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5">Examples that Inspired this Tutorial</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1">RailsCasts</h3>
<div class="outline-text-3" id="text-5-1">
<ul class="org-ul">
<li>The two RailsCasts episodes complement the <a href="http://www.youtube.com/watch?v=Ga99hMi7wfY">first tutorial by Tom Dale</a> by
showing how to add persistence via the <code>rails-ember</code> gem. The serializers
episode is also useful.
<ul class="org-ul">
<li><a href="http://railscasts.com/episodes/408-ember-part-1">#408 Ember Part 1</a> (pro)
</li>
<li><a href="http://railscasts.com/episodes/410-ember-part-2">#410 Ember Part 2</a> (pro)
</li>
<li><a href="http://railscasts.com/episodes/409-active-model-serializers?view=comments">#409 Active Model Serializers</a>
</li>
</ul>
</li>
<li>Tip: Using Chrome to watch the videos: I found that the left/right arrow and
space bar keys are amazing for pausing and rewinding the RailsCasts so that I
could get all the nuances of the Ember naming schemes.
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2">ember_data_example</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li><a href="https://github.com/dgeb/ember_data_example">ember_data_example</a> on GitHub is a nice full featured ember app with a parent
child relationship of contacts and phone numbers. It even has some examples
of using <a href="https://github.com/jfirebaugh/konacha">Konacha for testing Ember JavaScript code</a>.
</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6">Source Code for Views and JavaScript</h2>
<div class="outline-text-2" id="text-6">
<p>
I purposefully kept these to just 2 files to make this example simple. In a
real world application, this would be broken into many files.
</p>
</div>
